In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('example.db')

In [3]:
cursor = conn.cursor()

In [117]:
sql = '''CREATE TABLE EMPLOYEE(
    FIRST_NAME CHAR(20) NOT NULL,
    LAST_NAME CHAR(20),
    AGE INT,
    SEX CHAR(1),
    INCOME FLOAT
);
'''

In [118]:
cursor.execute(sql)

In [119]:
conn.commit()

In [116]:
cursor.execute("DROP TABLE CUSTOMER")
conn.commit()

cursor.execute("DROP TABLE EMPLOYEE")
conn.commit()

In [115]:
cursor.execute("DELETE FROM CUSTOMER")
conn.commit()

In [ ]:
sql = '''CREATE TABLE student(
    FIRST_NAME CHAR(20) NOT NULL,
    LAST_NAME CHAR(20),
    AGE INT,
    SEX CHAR(1),
    INCOME FLOAT
);
'''
cursor.execute(sql)
conn.commit()

In [121]:
cursor.execute('''
INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
VALUES ('Ramya', 'Rama Priya', 27, 'F', 9000)
''')
cursor.execute('''
INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
VALUES ('Sharukh', 'Sheik', 25, 'M', 8300)
''')
cursor.execute('''
INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
VALUES ('Sarmista', 'Sharma', 26, 'F', 10000)
''')
cursor.execute('''
INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
VALUES ('Sunil', 'Thapa', 24, 'M', 60000)
''')
cursor.execute('''
INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
VALUES ('Teja', 'Sharma', 28, 'M', 5000)
''')
conn.commit()

In [122]:
cursor.execute('''SELECT * FROM EMPLOYEE''')
rows = cursor.fetchall()
for r in rows:
    print(r)
# conn.commit()

('Ramya', 'Rama Priya', 27, 'F', 9000.0)
('Sharukh', 'Sheik', 25, 'M', 8300.0)
('Sarmista', 'Sharma', 26, 'F', 10000.0)
('Sunil', 'Thapa', 24, 'M', 60000.0)
('Teja', 'Sharma', 28, 'M', 5000.0)

In [123]:
cursor.execute('''
INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
VALUES ('Samir', 'Khanal', 25, 'M', 50000),
('Sushil', 'Basi', 25, 'M', 50000)
''')
conn.commit()

In [124]:
cursor.execute('''
INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
VALUES ('Ram', 'Thapa', 24, 'M', 60000)
''')
cursor.execute('''
INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
VALUES ('Shyam', 'Sharma', 28, 'M', 5000)
''')
conn.commit()

In [125]:
# execute many

In [126]:
cursor.execute('SELECT * FROM EMPLOYEE')
data = cursor.fetchone()
print(data)

('Ramya', 'Rama Priya', 27, 'F', 9000.0)

In [127]:
data = cursor.fetchone()
print(data)

('Sharukh', 'Sheik', 25, 'M', 8300.0)

In [128]:
cursor.execute('SELECT * FROM EMPLOYEE')
data = cursor.fetchmany(2)
print(data)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0)]

In [129]:
cursor.execute('SELECT * FROM EMPLOYEE')
data = cursor.fetchmany(4)
print(data)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sarmista', 'Sharma', 26, 'F', 10000.0), ('Sunil', 'Thapa', 24, 'M', 60000.0)]

In [130]:
data = cursor.fetchmany(4)
print(data)

[('Teja', 'Sharma', 28, 'M', 5000.0), ('Samir', 'Khanal', 25, 'M', 50000.0), ('Sushil', 'Basi', 25, 'M', 50000.0), ('Ram', 'Thapa', 24, 'M', 60000.0)]

In [131]:
data = cursor.fetchall()
print(data)

[('Shyam', 'Sharma', 28, 'M', 5000.0)]

In [132]:
# when previous query is used to fetch data, the cursor goes to next row. Hence, once all the records gets excuted
# there's no record to return so it's [].

In [133]:
data = cursor.fetchmany(4)
print(data)

[]

In [134]:
data = cursor.fetchall()
print(data)

[]

In [135]:
sql = '''
    UPDATE EMPLOYEE SET AGE=AGE+1 WHERE SEX = 'M';
'''
cursor.execute(sql)
conn.commit()

In [136]:
def print_all():
    cursor.execute('''SELECT * FROM EMPLOYEE''')
    rows = cursor.fetchall()
    for r in rows:
        print(r)
# conn.commit()

In [137]:
print_all()

('Ramya', 'Rama Priya', 27, 'F', 9000.0)
('Sharukh', 'Sheik', 26, 'M', 8300.0)
('Sarmista', 'Sharma', 26, 'F', 10000.0)
('Sunil', 'Thapa', 25, 'M', 60000.0)
('Teja', 'Sharma', 29, 'M', 5000.0)
('Samir', 'Khanal', 26, 'M', 50000.0)
('Sushil', 'Basi', 26, 'M', 50000.0)
('Ram', 'Thapa', 25, 'M', 60000.0)
('Shyam', 'Sharma', 29, 'M', 5000.0)

In [138]:
sql = '''
ALTER TABLE EMPLOYEE
ADD EMPLOYEE_ID INT PRIMARY_KEY AUTO_INCREMENT;
'''
cursor.execute(sql)
conn.commit()

In [139]:
print_all()

('Ramya', 'Rama Priya', 27, 'F', 9000.0, None)
('Sharukh', 'Sheik', 26, 'M', 8300.0, None)
('Sarmista', 'Sharma', 26, 'F', 10000.0, None)
('Sunil', 'Thapa', 25, 'M', 60000.0, None)
('Teja', 'Sharma', 29, 'M', 5000.0, None)
('Samir', 'Khanal', 26, 'M', 50000.0, None)
('Sushil', 'Basi', 26, 'M', 50000.0, None)
('Ram', 'Thapa', 25, 'M', 60000.0, None)
('Shyam', 'Sharma', 29, 'M', 5000.0, None)

In [140]:
sql = '''
UPDATE EMPLOYEE SET EMPLOYEE_ID=EMPLOYEE_ID+1;
'''
cursor.execute(sql)
conn.commit()

In [141]:
print_all()

('Ramya', 'Rama Priya', 27, 'F', 9000.0, None)
('Sharukh', 'Sheik', 26, 'M', 8300.0, None)
('Sarmista', 'Sharma', 26, 'F', 10000.0, None)
('Sunil', 'Thapa', 25, 'M', 60000.0, None)
('Teja', 'Sharma', 29, 'M', 5000.0, None)
('Samir', 'Khanal', 26, 'M', 50000.0, None)
('Sushil', 'Basi', 26, 'M', 50000.0, None)
('Ram', 'Thapa', 25, 'M', 60000.0, None)
('Shyam', 'Sharma', 29, 'M', 5000.0, None)

In [142]:
sql = '''
ALTER TABLE EMPLOYEE RENAME TO CUSTOMER
'''
cursor.execute(sql)
conn.commit()

In [143]:
def print_all_customer():
    cursor.execute('''SELECT * FROM CUSTOMER''')
    rows = cursor.fetchall()
    for r in rows:
        print(r)

In [144]:
print_all_customer()

('Ramya', 'Rama Priya', 27, 'F', 9000.0, None)
('Sharukh', 'Sheik', 26, 'M', 8300.0, None)
('Sarmista', 'Sharma', 26, 'F', 10000.0, None)
('Sunil', 'Thapa', 25, 'M', 60000.0, None)
('Teja', 'Sharma', 29, 'M', 5000.0, None)
('Samir', 'Khanal', 26, 'M', 50000.0, None)
('Sushil', 'Basi', 26, 'M', 50000.0, None)
('Ram', 'Thapa', 25, 'M', 60000.0, None)
('Shyam', 'Sharma', 29, 'M', 5000.0, None)

In [152]:
sql = '''
ALTER TABLE CUSTOMER
DROP EMPLOYEE_ID;
'''
cursor.execute(sql)
conn.commit()

In [153]:
sql = '''
ALTER TABLE CUSTOMER
ADD EMPLOYEE_ID INTEGER;
'''
cursor.execute(sql)
conn.commit()

In [154]:
print_all_customer()

('Ramya', 'Rama Priya', 27, 'F', 9000.0, None)
('Sharukh', 'Sheik', 26, 'M', 8300.0, None)
('Sarmista', 'Sharma', 26, 'F', 10000.0, None)
('Sunil', 'Thapa', 25, 'M', 60000.0, None)
('Teja', 'Sharma', 29, 'M', 5000.0, None)
('Samir', 'Khanal', 26, 'M', 50000.0, None)
('Sushil', 'Basi', 26, 'M', 50000.0, None)
('Ram', 'Thapa', 25, 'M', 60000.0, None)
('Shyam', 'Sharma', 29, 'M', 5000.0, None)

In [155]:
max_val = 1
cursor.execute('SELECT * FROM CUSTOMER WHERE EMPLOYEE_ID IS NULL')
rows = cursor.fetchall()
for r in rows:
    cursor.execute("UPDATE CUSTOMER SET EMPLOYEE_ID = ? WHERE FIRST_NAME = ?", (max_val, r[0]))
    max_val += 1

In [156]:
print_all_customer()

('Ramya', 'Rama Priya', 27, 'F', 9000.0, 1)
('Sharukh', 'Sheik', 26, 'M', 8300.0, 2)
('Sarmista', 'Sharma', 26, 'F', 10000.0, 3)
('Sunil', 'Thapa', 25, 'M', 60000.0, 4)
('Teja', 'Sharma', 29, 'M', 5000.0, 5)
('Samir', 'Khanal', 26, 'M', 50000.0, 6)
('Sushil', 'Basi', 26, 'M', 50000.0, 7)
('Ram', 'Thapa', 25, 'M', 60000.0, 8)
('Shyam', 'Sharma', 29, 'M', 5000.0, 9)

In [158]:
cursor.execute('''DELETE FROM CUSTOMER WHERE AGE > 25''')
conn.commit()

In [162]:
print_all_customer()

('Sunil', 'Thapa', 25, 'M', 60000.0, 4)
('Ram', 'Thapa', 25, 'M', 60000.0, 8)

In [171]:
cursor.execute('''SELECT * FROM CUSTOMER WHERE AGE < 26''')
record = cursor.fetchone()[0]
cursor.execute('''DELETE FROM CUSTOMER WHERE FIRST_NAME = ?''', (record,))
conn.commit()

In [172]:
print_all_customer()

('Ram', 'Thapa', 25, 'M', 60000.0, 8)

In [173]:
import pandas as pd

In [175]:
df = pd.read_sql_query('SELECT * FROM CUSTOMER', conn)

In [176]:
df.head()

  FIRST_NAME LAST_NAME  AGE SEX   INCOME  EMPLOYEE_ID
0        Ram     Thapa   25   M  60000.0            8

In [178]:
cursor.execute('''ALTER TABLE CUSTOMER DROP SEX''')
conn.commit()

In [179]:
print_all_customer()

('Ram', 'Thapa', 25, 60000.0, 8)

In [180]:
cursor.execute("DROP TABLE CUSTOMER")
conn.commit()